[
  {
    "id": "40f1ab7e-445a-4b39-ad8e-41ddb7b36f56",
    "name": "resume.pdf",
    "content": "\n\nNo 15, Jalan Residensi 1, \nTaman Residensi,  \nKipark, Sri Utara, \n68100, Kuala Lumpur \n+60127173985 \nLiew Qi Jian \nderekliew0@gmail.com \nEDUCATION  \nChong Hwa Independent High School – Kuala Lumpur                                                                                      Jan 2016 – March 2021 \nSyllabus taken: SPM \nResults: 2A+, 5A, 3B \nSociety Joined: Lion Dance Society  \nTunku Abdul Rahman University College – Kuala Lumpur June 2021 – September 2022 \nSyllabus taken: A- Levels \nRelated Coursework: Physics, Computing, Mathematics, Languages \nTunku Abdul Rahman University College – Kuala Lumpur             June 2023 – Current \nCourse taken: Bachelor Degree of Computer Science in Data Science \nRelated Coursework: Programming, Web Development, Application Development, Statistical Analysis, Data Science, Artificial \nIntelligence and Machine Learning. \nResults: CGPA 3.84 \nWORKING EXPERIENCE  \nKW FURNITURE HARDWARE – Part Time Software Assistant; Kuala Lumpur                    2016 – Current \n▪\nAssisted with implementing a software in stock management. \n▪\nDeveloped an application for orders and stock management. \n▪\nAided founder to communicate with other suppliers.  \n▪\nAssisted with accounting tasks and some administrative tasks.  \nSWIMLIFE ACADEMY – Part Time Swimming Coach; Kuala Lumpur                   2021 –2022 \n▪\nConducted swimming class for adults and children. \n▪\nImplemented a systematic syllabus for efficiency learning curve. \n▪\nCommunicate with parents and provide updates and suggestion for students.  \nCIMA LIGHTING SDN. BHD.  – Showroom Assistant; Kuala Lumpur       Jan2023 - June 2023 \n▪\nProvide information about interior and electrical appliances.  \n▪\nGave professional ideas to customers about interior design, home cabling and interior remaking. \n▪\nAssisted the supervisor in shopkeeping and inventory checking.  \n▪\nGot the “Top Sales Award” for May 2023. \nLITTLE MASTER EDUCATION HOLDINGS – Online Tuition Teacher; Cyberjaya       Jan2024 - Current \n▪\nMake sure children keep up with their studies. \n▪\nConducted lesson for primary school students. \n▪\nTaught English, Bahasa Malaysia and Chinese. \n▪\nGuide students on their work and performance. \nLEADERSHIP EXPERIENCE  \nLion Dance Club – Chong Hwa Independent High School, Vice President                  2020 – 2021 \n▪\nLead the society whenever there is performance, competition, activities etc.  \n▪\nImplemented some new system in the society to ensure smooth flow, high consistency and highly repeatable in the future.  \nTARUMT Blockchain Club – Tunku Abdul Rahman University of Management and Technology, Founder/ President      2024 – current \n▪\nCurrently leading a group of 10 committees for establishment. \n▪\nBrought 20+ connections from the industries to the club. \n\nSKILLS/INTERESTS  \n▪\nProgramming language: C++, HTML, JavaScript, Python, CSS, Java, SQL, R programming, Solidity, Cairo, Rust, TypeScript \n▪\nFrameworks: Next.js, React.js, Three.js, Node.js, Phaser.js, Tensorflow, PyTorch, OpenCV, ScikitLearn, Flask, HardHat \n▪\nSoftware Proficiency: SAS Studio, SAS Viya, Basic Microsoft Software (Word, Excel etc), Adobe Software (Photoshop, Premier \nPro) \n▪\nHave basic understandings and experience in machine learning algorithm, deep learning, web development, web3 and data \nanalytics \n▪\nFluent in Mandarin, Bahasa Malaysia and English  \n▪\nStrong communicating skills, leadership skills, critical thinking and programming logic. \n▪\nCurrently exploring AI and Web3 for knowledge enhancement.  \n▪\nInterests: Basketball, Swimming, Programming \nACHIEVEMENTS/AWA R D S  \n•\n   Participant in Teratai Cup 2022  \n•\n   Performer of CHKL Gala Night 2019 \n•\n   31\nst\n Placement in SAS Curiosity Cup 2024 \n•\n   Participant in TARUMT TV Hackathon 2024 \n•\n   Finalist in TARUMT International Hackathon \n•\n   Participant in ImagineHack 2024 @ Taylors University \n•\n   Champion in HackInsan 2024 @ USIM Nilai \n•\n   Dean List Achiever in Session 202309 \n•\n   President List Achiever in Session 202401 \n•\n   Participant in Virtual Protocol Contribution Challenge \n•\n   2\nnd\n Runner Up in Bridg3 Hackathon 2024 @ Malaysia Blockchain Week \n•\n   Finalist / Participant in Llama3 Hackathon 2024 \n•\n   Participant in AESEAN Data Science Explorer @ TARUMT \n•\n   Participant in NexTech Conference @ Taylors University \n•\n   Champion in APUBCC Devmatch Hackathon for Aptos Track \n•\n   9\nth\n Place in Monash Hackfest 2024 \n•\n   2\nnd\n Place in Buildstation Ideathon 2024 \n•\n   Consolation Prize in Data Science Digital Race 2024 \n•\n   Near Protocol, World Coin Prize winner in ETH Global Singapore Hackathon \n•\n   Top 5 Finalist, 2nd Place in ICP track, Scroll, Worldcoin, ORA Prize winner in ETH KL Hackathon \n•\n   Blockscout Prize Pool, Coinbase Developer Platform Prize Pool, Coinbase Onchainkit Prize Pool in ETH Bangkok Hackathon \n•\n   3rd Place in PayHack 2024 \n\nPROJECTS   \nSchool Assignments                    \n▪\nA sports organization assembly language program. (written with 8086 Assembly Language Dosbox) \n▪\nA food organization ordering console application (written in C++) \n▪\nA food organization website with cart and food ordering / delivering (written in HTML, CSS and Java Script) \n▪\nA Java OOP program of a Point Redemption System \n▪\nA Python Flask framework web application that predicts garment employees’ productivity via Machine Learning Models  \n▪\nA flight operation Database Management System using SQL \n▪\nA Springboot + Next.js web application that helps user to manage donations, distribute donations and manage events. \n▪\nA garbage classification computer vision project using Flask + Next.js \n▪\nA airplane management system DBMS using SQL \nEncryption / Decryption Project                    \n▪\nA Python Flask web application that detects data leakage, encrypt and decrypt data. This algorithm is also implemented inside \ndemos which are included in this project \nLEarn                  \n▪\nA Next.js web app which is a play to earn game to teach teenagers about financial literacy. \n▪\nThe project submitted in ImagineHack 2024 \n  LEarn 2                  \n▪\nA Next.js web app which is a play to earn game to teach teenagers about financial literacy. \n▪\nUpdated functionality and UI.  \n▪\nImplemented Smart Contracts, SUI Features and Gen AI  \n▪\nWinning project in Bridg3 Hackathon \nWorkout Tracer                    \n▪\nA MERN web application that note workout routines, uses a database to store the workout and trace user performance. It has basic \nanalysis algorithms to analyze the performance. \nWeb App for Summit Features                    \n▪\nA Next.js web app that utilize Tensor Flow, Three.js, Face API, OpenCV and Vercel to perform 3D modelling and motion capture \nsimultaneously.  \n▪\nWinning project in HackInsan 2024.  \n LEarn 3                    \n▪\nA mono-repo multichain gamified learning platform that utilize blockchain, NFT. \n▪\nBuilt on Scroll, Aptos and Maschain, applied tech stacks from the documentation of each respective chains. \n▪\nWinning project in Devmatch Hackathon 2024. \n223                   \n▪\nAn AI + Defi application that help user to perform various transaction task in one platform. \n▪\nWinning project in Monash Hackfest 2024. \nonlyBlinks                  \n▪\nAn AI application that helps user to track, manage, analyze and create blinks in one platform \n▪\nWinning project in Buildstation Ideathon 2024. \nNEARer                  \n▪\nAn AI application that helps user to perform transactions, staking, chain fusions, wallet managements.  \n▪\nWinning project in ETH Global Singapore Hackathon. \njustETH                  \n▪\nA food review application with AI sentiment analysis and dynamic rating power based on food palette, reliability and context. \n▪\nWinning project in ETH KL Hackathon. \n\nSolana Wallet Analytics App                  \n▪\nA wallet analytic application that can track wallet balance and transactions.   \nChess Deep learning                  \n▪\nAn AI chess deep learning program that can provide the best moves based on opponent moves. \nLeBron Shot Prediction                   \n▪\nA machine learning project that analyze and predict the probability of LeBron James hitting a shot based on selected criteria. \nAI traffic light detection                  \n▪\nAn image classification project that can classify the state of traffic lights.  \nTetris to Earn                   \n▪\nTetris game created using Phaser.js, can be used to integrate in game currency and NFTs.  \nStock Price Dashboard                   \n▪\nA simple stock price dashboard using python and Streamlit.  \nAI Rag                  \n▪\nAn AI powered chat bot that can read user’s data and answer questions. \neThAi                  \n▪\nAn AI aggregation platform that aggregates user models and make AI training on chain \n▪\nPrototype submitted in ETH Global Bangkok Hackathon. \nFinPet                  \n▪\nA gamified personal finance management app that let user adapts the habit of saving money.  \n▪\nWinning prototype of PayHack 2024. \n   \nGithub Link: https://github.com/derek2403?page=1&tab=repositories \nNote: More projects can be found in the Git Hub link attached with this resume, please refer to my Git Hub repo for more uncompleted/ in progress projects. ",
    "timestamp": 1733209617822
  }
]