[
  {
    "id": "3aacbfa4-4ade-4845-b678-d9e95f13a281",
    "name": "Understanding Mental Health.pdf",
    "content": "\n\nUNDERSTANDING MENTAL HEALTH\nWHAT IS MENTAL HEALTH?\nOur mental health directly influences how we think, feel and act: it also affects our physical health. Work, in fact, is actually one of \nthe best things for protecting our mental health, but it can also adversely affect it. \nGood mental health and well-being is not an on-off \nexperience. We can all have days, weeks or months \nwhere we feel resilient, strong and optimistic, \nregardless of events or situations. Often that can \nbe mixed with or shift to a very different set of \nthoughts, feelings and behaviours; or not feeling \nresilient and optimistic in just one or two areas of \nour life.  For about twenty-five per cent of us, that \nmay shift to having a significant impact on how \nwe think, feel and act in many parts of our lives, \nincluding relationships, experiences at work, sense \nof connection to peer groups and our personal sense \nof worth, physical health and motivation. This could \nlead to us developing a mental health condition such \nas anxiety, depression, substance misuse. \nMental health is a positive concept related to the \nsocial and emotional wellbeing of people and \ncommunities.\nThe concept relates to the enjoyment of life, ability \nto cope with stress and sadness, the fulfilment of \ngoals and potential, and a sense of connection to \nothers. Mental health is about wellness rather than \nillness and is not merely the absence of a mental \nhealth condition.\nLike physical health, mental health is not fixed. \nMental health exists on a continuum, or range:  \nfrom positive, healthy functioning at one end \nthrough to severe symptoms of mental health \nconditions at the other.\nA person’s mental health moves back and forth along this range during \ntheir lifetime, in response to different stressors and circumstances. At \nthe green end of the continuum, people are well; showing resilience \nand high levels of wellbeing. Moving into the yellow area, people \nmay start to have difficulty coping. In the orange area, people have \nmore difficulty coping and symptoms may increase in severity and \nfrequency. At the red end of the continuum, people are likely to be \nexperiencing severe symptoms and may be at risk of self-harm or \nsuicide.\nRisk factors and protective factors influence mental health and can \nnudge people back and forth along the continuum. They can be \nindividual or related to family, work or other life circumstances.\nRisk factors may increase the strain on our mental health, while \nprotective factors can counteract these by helping us to stay or \nbecome well. With much of people’s time each day spent at  work, the \nworkplace is a very influential environment when it comes to mental \nhealth and wellbeing. A positive and supportive workplace can mean \nthe difference between being ‘in the green’ or ‘in the orange’. \n(Source Beyondblue).\nPositive, healthy \nfunctioning\nSevere impact on everyday \nfunctioning\n\nCOMMON MENTAL HEALTH CONDITIONS \nThe purpose of this information is to give you greater understanding \nof these issues. If you are concerned about yourself or a colleague, \nprofessional assistance is recommended.\nRemember, it is not your job to diagnose yourself \nor someone else.\nVisit these videos on:\n \nANXIETY  \nDEPRESSION \nSUBSTANCE MISUSE \nREACTIONS TO CRITICAL INCIDENTS AND TRAUMA  \nTHE LANGUAGE WE USE\n• can include or exclude someone and says a lot about our own approach to and inclusion of mental illness. \n• What words and phrases have you heard?\n• What words and phrases have you used?\n• Please take a few moments to write them down and then read the table below to learn about the impact of words and how to use \ndifferent words to be more inclusive. \n• What will you use next time you speak about mental health conditions? \nISSUEPROBLEMATICPREFERRED\nCertain language sensationalises \nmental ill-health and reinforces \nstigma \nTerms such as ‘mental patient’, \n‘nutter’, ‘lunatic’, ‘psycho’, ‘schizo’, \n‘deranged’, ‘mad’ \nA person is ‘living with’ or ‘has a \ndiagnosis of’ a mental illness\nTerminology that suggests a lack of \nquality of life for people with mental \nill-health\nReferring to someone with a mental \nillness as a ‘victim’, ‘suffering from’ or \n‘afflicted with’ a mental illness\nA person is ‘being treated for’ or \n‘someone with’ a mental illness\nLabelling a person by their mental \nillness\nA person is a 'schizophrenic', 'an \nanorexic'\nA person ‘has a diagnosis of’ or ‘is \nbeing treated for’ schizophrenia.\nDescriptions of behaviour that imply \nexistence of mental ill-health or are \ninaccurate\nUsing words such as ‘crazed’, \n‘deranged’, ‘mad’, ‘psychotic’\nThe person's behaviour was unusual \nor erratic\n\nISSUEPROBLEMATICPREFERRED\nColloquialisms about treatment can \nundermine people’s willingness to \nseek help\nUsing words such as ‘happy pills’, \n‘shrinks’, ‘mental institution’\nAccurate terminology for treatments \ne.g. antidepressants, psychiatrists or \npsychologists, mental health hospital\nTerminology used out of context adds \nto misunderstanding and trivialises \nmental ill-health\nTerms like ‘psychotic dog’, using \n‘schizophrenic’ to denote duality such \nas ‘schizophrenic economy’\nReword any sentence that uses \npsychiatric or medical terminology \nincorrectly or out of context\n(Source: Time-to-change)\nFor more information:\nhttps://www.time-to-change.org.uk/media-centre/responsible-reporting/mind-your-language\nhttps://mindframe.org.au/mental-health/communicating-about-mental-ill-health\nWORKPLACE MENTAL HEALTH AND WELL-BEING STRATEGY\nwww.un.org/en/healthy-workforce",
    "processedContent": "stand mental health mental health mental health influence feel act affect physic health work fact protect mental health advers affect good mental health wellb onoff experi dai week month feel resili strong optimist event situate mix shift set think feel behaviour feel resili optimist area life twentyf cent shift signify impact feel act part live include relationship experi work sens connect peer group son sens worth physic health motive lead develop mental health condit anxieti press substance us mental health posit concept relate social emote wellb people commune concept relate joie life abil cope stress sad fulfil goal potenti sens connect mental health well ill absence mental health condit physic health mental health fix mental health ist continuum ring posit healthi function sever symptom mental health condit son mental health move ring lifetime respons stressor st green continuum people show resili high level wellb move yellow area people start difficulti cope orange area people difficulti cope symptom increas sever frequency continuum people experience sever symptom risk harm suicide risk factor protect factor influence mental health nudge people continuum individu relate famili work life st risk factor increas strain mental health protect factor act help stai people time dai spend work workplace influenti environ mental health wellb posit support workplace differ green orange source beyondblu posit healthi function sever impact everydai function mon mental health condit purpos inform give greater stand issue concern colleague profess assist commend rememb job diagnos visit video anxieti press substance us action critic incid trauma language include exclude lot approach inclus mental ill word phrase hear word phrase moment write ad table learn impact word word inclus time speak mental health condit issueproblematicpref language sensationalis mental illhealth reinforce stigma term mental patient nutter lunat psycho schizo ring mad son live diagnosi mental ill terminology suggest lack qualiti life people mental illhealth fer mental ill victim suffer afflict mental ill son treat mental ill label son mental ill son schizophren anorex son diagnosi treat schizophrenia script behaviour impli ist mental illhealth inaccur word craze ring mad psychot son behaviour unusu errat issueproblematicpref colloqui treatment min people will seek word happi pill shrink mental institute accur terminology treatment press psychiatrist psychologist mental health hospit terminology context add understand trivialis mental illhealth term psychot dog schizophren not dualiti schizophren economi word sentence psychiatry medic terminology incorrectli context source timetochang inform httpswwwtimetochangeorgukmediacentreresponsiblereportingmindyourlanguag httpsmindframeorgaumentalhealthcommunicatingaboutmentalillhealth workplace mental health wellb strategi wwwunorgenhealthyworkforc",
    "timestamp": 1746367557690
  }
]